Revit 2026 API

# ElementRecordGetBoundingBox Method

---

Gets the bounding box of the element record.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Outline GetBoundingBox()
```
```vb
Public Function GetBoundingBox As Outline
```
```cpp
public:
Outline^ GetBoundingBox()
```
```fsharp
member GetBoundingBox : unit -> Outline
```

#### Return Value

Outline The bounding box outline.  if there is no bounding box for this element.

#### Reference

ElementRecord Class

Autodesk.Revit.DB Namespace